validationCases/OFS3_1267/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1; //m

vertices
(
//x    y    z
(0 0    0 )    // vertex number 0
(1 0    0) //1
(1 0.16666  0) //2
(0 0.16666  0)//3
(0 0    0.005) //4   // vertex number 0
(1 0    0.005) //5
(1 0.16666  0.005) //6
(0 0.16666  0.005)//7

);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (600 100 1)// numbers of cells in each direction
    simpleGrading (1 1 1)    // cell expansion ratios, last/first
)

edges
(
);

boundary               // keyword
    (
        left              // patch name
        {
            type wall;    // patch type for patch 0
            faces
            (
                (0 4 7 3)  // block face in this patch
            );
        }                  // end of 0th patch definition

        right              // patch name
        {
            type wall;    // patch type for patch 0
            faces
            (
                (6 5 1 2)  // block face in this patch
            );
        }                  // end of 0th patch definition

        sym              // front and back
        {
            type empty;
            faces
            (
                        (7 4 5 6)
                        (2 1 0 3)
            );
        }

        top
        {
            type wall;
            faces
            (
                (2 3 7 6)
            );
        }
        bottom
        {
            type wall;
            faces
            (
              (0 1 5 4)
            );
        }
    );

mergePatchPairs
(
);

// ************************************************************************* //
