validationCases/OFS3_1267/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}


mixture
{
    specie
    {
        molWeight   18;
    }
    equationOfState
    {
        rho 1;
    }
    thermodynamics
    {
            Cp     4389.65; //J/kg/K
            Hf              0; //h = cp*T + Hf
            //liquid is at ref state, Hf=0
    }
    
    transport
    {
        mu          9.659e-5;
        Pr          4.24;
    }
}

// ************************************************************************* //
