validationCases/OFS3_1267/0.orig/alpha.vapor
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alpha.vapor;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  bottom
  {
      type            zeroGradient; //insulated
  }
  
  top
  {
    type            zeroGradient;
  }

  sym{type empty;}

  left
  {
        type            zeroGradient;
      }
  right
  {
        type            zeroGradient;
     }
}
// ************************************************************************* //
