validationCases/OFS3_1267/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler; //CoEuler CrankNicolson Euler SLTS backward bounded localEuler steadyState)
}

gradSchemes
{
    default         leastSquares;
}

divSchemes
{
    default         Gauss linear;

    div(rhoPhi,U)   Gauss limitedLinearV 1;
    div(rhoPhi,T)   Gauss linearUpwind grad(T);

    div(phi,alpha)  Gauss vanLeer01; //interface interpolation scheme
    // Gauss interfaceCompression vanLeer 1;
    // Gauss PLIC interfaceCompression vanLeer 1;
    div(phirb,alpha) Gauss linear;

    div(phi,p)      Gauss upwind;
    div(rhoPhi,K)   Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(rhoCpPhi,T)       Gauss upwind;
    div((interpolate(cp)*rhoPhi),T) Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
