validationCases/OFS3_1267/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues // below patches will overwrite
(
    volScalarFieldValue alpha.vapor 1
    volScalarFieldValue alpha.liquid 0
    volScalarFieldValue T 299
);

regions
(
boxToCell
{
  box (0 0 0)(1 0.0833333 0.2);

fieldValues
(
  volScalarFieldValue alpha.liquid 1
  volScalarFieldValue alpha.vapor 0
);
}

);




// ************************************************************************* //
